#---第2部Stan入門編---第5章基本的な回帰とモデルのチェック---5.1重回帰
#---Jiro Nagao

#---

#---2024-09-09-Monday

#-------------------------------------------------------------------------------
setwd("C:/Users/njiro/OneDrive/O_DRV/WD/R_WD/lsn/matsu/MLR5")
rm(list = ls())
wd <- getwd()
#wd

#-------------------------------------------------------------------------------
#---パッケージ読込
library(tidyverse)
#library(ggplot2)
#library(gridExtra)
library(rstan)
#library(ggmcmc)
#library(patchwork)

#-------------------------------------------------------------------------------
indt <- paste0(wd, "/input")
outdt <- paste0(wd, "/output")
mdl <- paste0(wd, "/stan_model")
gra <- paste0(wd, "/graph")

#-------------------------------------------------------------------------------
#---初期設定関数
setting <- function(){
  set <- data.frame(
    seed = 123,
    chain = 3,
    iter = 1000,
    warmup = 200,
    thin =2
  )
  return(set)
}

#-------------------------------------------------------------------------------
#---csv読込関数
rd_csv <- function(path, filename){
  df <- read.csv(
    file = paste0(
      path,
      "/",
      filename
    ),
    header = TRUE
  )
  return(df)
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
#---main program
#-------------------------------------------------------------------------------
#---初期設定
set <- setting()

#---csv読込
ifnm1 <- "data-attendance-1.txt"
df <- rd_csv(indt, ifnm1)
#head(df)

#-------------------------------------------------------------------------------

#-------------------------------------------------------------------------------

